# Install casks in the App dir
cask_args appdir: "/Applications"

# Taps
tap 'mas-cli/tap' # To install mas on MacOS Mojave

# Brews
brew 'git'     # Newer version of git
brew 'zsh'
brew 'mas'     # To install Mac App Store apps

# Casks
# cask 'slack'
cask 'rubymine'
cask 'visual-studio-code'
cask 'iterm2'
cask 'docker'

cask "rectangle", args: { appdir: "~/Applications/Utilities" } # window manager

# Browsers
cask 'google-chrome'

# Audio/Video
cask 'spotify'
cask 'spotmenu' # Spotify in menu bar
cask 'vlc'

# IM
cask 'whatsapp'
cask 'discord'

# App Store
mas 'Bear', id: 1091189122
mas 'Clocker', id: 1056643111
mas 'Spark', id: 1176895641
